{
  "product_id": "B01J24C0TI",
  "product_info": {
    "name": "Amazon Echo Show Alexa-enabled Bluetooth Speaker with 7\" Screen",
    "brand": "Amazon",
    "category": "Electronics,Hardware",
    "id": "B01J24C0TI",
    "url": "https://www.amazon.com/dp/B01J24C0TI"
  },
  "timestamp": "2024-12-04T19:35:31.374605",
  "summary": {
    "overall_sentiment": "positive",
    "confidence_score": 0.9724615384615385,
    "review_counts": {
      "positive": 185,
      "neutral": 6,
      "negative": 4
    },
    "recommendation": "Highly recommended based on consistently positive reviews."
  },
  "detailed_analysis": [
    {
      "review": "I love having the screen available to use for certain tasks like streaming doorbell video, security camera footage, Amazon Prime music lyrics and videos, but I am disappointed that Amazon‚Äôs implementation of YouTube on the Echo Show violated Google's terms of service so they got the app pulled from the Show. Also, honestly, and anyone can prove it just through everyday use, but the Echo is just not as useful as Google Assistant with inquiries. It works pretty well with home automation but it just doesn't understand or can't help with about half of the inquiries I throw at it. I would have gone with a Google Home if there was one with a touchscreen. I would recommend it for those heavily invested in Amazon Prime and home automation.",
      "processed": "love screen available use certain tasks like streaming doorbell video security camera footage amazon prime music lyrics videos disappointed implementation youtube echo show violated google terms service got app pulled show also honestly anyone prove everyday use echo useful google assistant inquiries works pretty well home automation understand ca help half inquiries throw would gone google home one touchscreen would recommend heavily invested amazon prime home automation",
      "sentiment": "positive",
      "confidence": 0.915
    },
    {
      "review": "Love it Love it Love it!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "processed": "love love love",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Love this. Just replaced my old echo with this one. Love Alexa.",
      "processed": "love replaced old echo one love alexa",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "This is great! Like having a robot brain in your house.",
      "processed": "great like robot brain house",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Alexa Show is really well put together. The main reason for my purchase was to create my own 'surveillance system' linking my Ring Doorbell, and Ring Floodlights to view on command by Alexa on the Show Screen. Yes, you can talk to it, and get results for almost any query, but with the show, you get a lot more. The touch screen is great for video calls, especially when you install the Alexa App on your family cell phones. Alexa can scan items via UPC and order them on Amazon, or tell you where to get them. The recipes you ask for are not only spoken to you, but SHOWN to you. Also, when music plays, you can see the lyrics on screen (If you use Amazon Music to play the music). You can ask for a news briefing, and you SEE the news, highlights, etc. The speakers aren't quite up to the same standard as the echo series, but it's close. The sound fills the room nicely. When the Echo Show is not being immediately used, the screen shows a picture of your choice, making it a digital frame too. Overall, the device is very nice, and they are constantly releasing new skills for Alexa to use, so it seems like there is always something new to wow you. Turning on and off lights, adjusting your thermostat, playing music, viewing security cameras are all just the standard duties, there is WAY more to do with this device!",
      "processed": "alexa show really well put together main reason purchase create system linking ring doorbell ring floodlights view command alexa show screen yes talk get results almost query show get lot touch screen great video calls especially install alexa app family cell phones alexa scan items via upc order amazon tell get recipes ask spoken shown also music plays see lyrics screen use amazon music play music ask news briefing see news highlights etc speakers quite standard echo series close sound fills room nicely echo show immediately used screen shows picture choice making digital frame overall device nice constantly releasing new skills alexa use seems like always something new wow turning lights adjusting thermostat playing music viewing security cameras standard duties way device",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "This is just what I was looking for. It does just what it says it does!",
      "processed": "looking says",
      "sentiment": "positive",
      "confidence": 0.96
    },
    {
      "review": "This is perfect for any home it gives up to date news, you can set alarms and do so much more. We love this product",
      "processed": "perfect home gives date news set alarms much love product",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I couldn't believe how easy and fast the setup was. It's basically plug and play. I watched a video first and it took no more than 3 minutes to get going. You don't need any other equipment to set it up. The sound is unbelievable...better than my Bose.",
      "processed": "could believe easy fast setup basically plug play watched video first took minutes get going need equipment set sound unbelievable better bose",
      "sentiment": "positive",
      "confidence": 0.98
    },
    {
      "review": "Upgraded from the echo to add video support for my cameras. Sound is much better",
      "processed": "upgraded echo add video support cameras sound much better",
      "sentiment": "positive",
      "confidence": 0.98
    },
    {
      "review": "The Echo Dot is a great personal assistant, and right now the price is fantastic. It can give you the weather forecast, traffic reports, daily news brief, play music from Pandora or other steaming radio stations, and answer questions, all in a very small package.. .",
      "processed": "echo dot great personal assistant right price fantastic give weather forecast traffic reports daily news brief play music pandora steaming radio stations answer questions small package",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Addition to my system...love talking and seeing my BFF in ATL...SUITS MY OFFICE decor.",
      "processed": "addition system love talking seeing bff atl suits office decor",
      "sentiment": "positive",
      "confidence": 0.975
    },
    {
      "review": "We love Alexa! Love being able to watch news briefings, seeing the lyrics to songs, and so much more! It's in our kitchen and we use it everyday!",
      "processed": "love alexa love able watch news briefings seeing lyrics songs much kitchen use everyday",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I bought this so my kids can talk to there Grandpa and it has been Great they call him all the time",
      "processed": "bought kids talk grandpa great call time",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Now I can view my front door Ring system as well as all my Arlo cameras. Great products. If you have Echo Spot in each bedroom, you can video talk with your kids by dropping in. Love it",
      "processed": "view front door ring system well arlo cameras great products echo spot bedroom video talk kids dropping love",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "Got this for my wife for Christmas. Was suppose to come wrapped but didn‚Äôt. Wife very happy. Avid amazon fan. Sound better then the echo.",
      "processed": "got wife christmas suppose come wrapped wife happy avid amazon fan sound better echo",
      "sentiment": "positive",
      "confidence": 0.915
    },
    {
      "review": "Use a lot of home automation and this is a great addtion. If you are not an Alexa or home automation fan I would recomend trying to catch this on sale, you may not need the screen a much as you think. The sound quality is great.",
      "processed": "use lot home automation great addtion alexa home automation fan would recomend trying catch sale may need screen much think sound quality great",
      "sentiment": "positive",
      "confidence": 0.98
    },
    {
      "review": "This is a great device that actually has a lot of usefulness to it. After about a week you're going to be wondering what else can I do? what else can this help you with? So my suggestion is to get one of these as a start. Then prioritize the purchase of an echo (not plus) and a spot.",
      "processed": "great device actually lot usefulness week going wondering else else help suggestion get one start prioritize purchase echo plus spot",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "Awesome so far. Have used it as alarm clock, stereo, 2nd screen for movies (while multitasking on PC), news/weather, audiobooks, and more. The news flash can repeat itself at times, but I may have subscribed to too many subcategories, but a quick alexa - next skips right ahead. Still learning the variations of commands, and sometimes it hears what it wants to until I have to ar. tic. u. late. to the point of annoyance, but hey, this is still relatively new tech, and who would have imagined this 20 years or more ago",
      "processed": "awesome far used alarm clock stereo screen movies multitasking pc audiobooks news flash repeat times may subscribed many subcategories quick alexa next skips right ahead still learning variations commands sometimes hears wants ar tic late point annoyance hey still relatively new tech would imagined years ago",
      "sentiment": "positive",
      "confidence": 0.92
    },
    {
      "review": "I like it. Needs more features to really become a good product. Needs browsing capabilities.",
      "processed": "like needs features really become good product needs browsing capabilities",
      "sentiment": "positive",
      "confidence": 0.98
    },
    {
      "review": "This is a great addition to the other Alexa products by Amazon. It works great in the kitchen. Better voice recognition and sound. The onscreen display and information are very helpful. The video capability is watching instructional videos or even playing music videos while working/cooking. It can also scroll personal photos as a picture display.All in all Echo Show is a wonderful addition. Well worth it, especially if you get it on sale.",
      "processed": "great addition alexa products amazon works great kitchen better voice recognition sound onscreen display information helpful video capability watching instructional videos even playing music videos also scroll personal photos picture echo show wonderful addition well worth especially get sale",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Purchased this item for our daughter. She absolutely loves it!",
      "processed": "purchased item daughter absolutely loves",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "After researching and reading endless reviews, I bought myself an early Christmas present in the Amazon Echo Show. Once I had it home, it was quickly set up and has been a joy to have since day one. Loved it so much I bought two more as gifts. So enjoying being able to see friends and family on a more regular basis with the video option. I‚Äôm sure as I learn more this will become even more useful. Great addition to my other Echo devices.",
      "processed": "researching reading endless reviews bought early christmas present amazon echo show home quickly set joy since day one loved much bought two gifts enjoying able see friends family regular basis video option sure learn become even useful great addition echo devices",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Alexa is a wealth of knowledge and learning more and more every day.",
      "processed": "alexa wealth knowledge learning every day",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I didn't think I needed Alexa to have a screen, but now I'm so glad we got this. When I ask to see my grocery list, it pops up on the screen. Also can do video calls from it. Really like our Alexa and the dots...we have them in almost every room of the house now.",
      "processed": "think needed alexa screen glad got ask see grocery list pops screen also video calls really like alexa dots almost every room house",
      "sentiment": "positive",
      "confidence": 0.985
    },
    {
      "review": "I am very pleased with the sound and picture quality. It does not link to direct tv.",
      "processed": "pleased sound picture quality link direct tv",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "This was a Black Friday special and we knew we wanted a smart home assistant and Alexa worked well with the Ring doorbell system. There are times when you have to ask her the same thing over and over until she figures it out but overall it was a food deal.",
      "processed": "black friday special knew wanted smart home assistant alexa worked well ring doorbell system times ask thing figures overall food deal",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Love talking face to face with family and friends back in the Philly area. It is easy to use and to stay in touch. I can show family things that I have recently bought by holding it up to the camera instead of having to go into a long description on a phone line.",
      "processed": "love talking face face family friends back philly area easy use stay touch show family things recently bought holding camera instead go long description phone line",
      "sentiment": "positive",
      "confidence": 0.97
    },
    {
      "review": "Once you have it, you can't live without it. Great product.",
      "processed": "ca live without great product",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "The show works great with my other products. Love it",
      "processed": "show works great products love",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Love the echo show & the ability to communicate with smaller children without any effort or cell phones.",
      "processed": "love echo show ability communicate smaller children without effort cell phones",
      "sentiment": "positive",
      "confidence": 0.975
    },
    {
      "review": "The echo show works very well with Bluetooth and WiFi. Great sound and screen. Recommend to anyone",
      "processed": "echo show works well bluetooth wifi great sound screen recommend anyone",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "All I really use it for is music. The read downfall is it‚Äôs not Bluetooth so it has to be plugged in 24/7",
      "processed": "really use music read downfall bluetooth plugged",
      "sentiment": "neutral",
      "confidence": 0.66
    },
    {
      "review": "I have all the echo products in this by far is the best it does everything . I love it!",
      "processed": "echo products far best everything love",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "We're hoping the Echo show will allow us to elevate our experiences using the screen options for calling family & friends as well as reading recipes etc.",
      "processed": "hoping echo show allow us elevate experiences using screen options calling family friends well reading recipes etc",
      "sentiment": "positive",
      "confidence": 0.99
    },
    {
      "review": "So I was skeptical of Echo Show and the entire line to be honest. However, this technology has changed how our household operates. From my daily briefing in the morning, to tracking Santa with my 6 year old every morning learning interesting facts about Santa and several other things, I truly wish I would have bought this sooner. We have it integrated into our Cozi account so we can just ask Alexa to add items to various shopping lists instead of pulling out a phone and typing it in. We also have ADT Pulse and a Nest thermostat and the integration into those two platforms was so simple I couldn't believe it. My son loves to ask Alexa questions and in the mornings before school he is learning things instead of just watching a few minutes of a cartoon.Another highly used feature is the local forecast as my wife is a weather nut and always wants to know what the forecast for the area is. I am loving the Amazon Music now as well because we bought an Echo Dot just to integrate into our Bose whole house system so we can stream music all through the house now.If you are on the fence about getting the Echo Show like I was, just do it. It really is an amazing product!",
      "processed": "skeptical echo show entire line honest however technology changed household operates daily briefing morning tracking santa year old every morning learning interesting facts santa several things truly wish would bought sooner integrated cozi account ask alexa add items various shopping lists instead pulling phone typing also adt pulse nest thermostat integration two platforms simple could believe son loves ask alexa questions mornings school learning things instead watching minutes highly used feature local forecast wife weather nut always wants know forecast area loving amazon music well bought echo dot integrate bose whole house system stream music house fence getting echo show like really amazing product",
      "sentiment": "positive",
      "confidence": 0.985
    },
    {
      "review": "I will have one for all my rooms. I will also buy some for friends",
      "processed": "one rooms also buy friends",
      "sentiment": "positive",
      "confidence": 0.985
    },
    {
      "review": "I can see my grandchildren when I call it is a great machine",
      "processed": "see grandchildren call great machine",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Love the screen and being able to see video along with my cameras on my Vivint smart home",
      "processed": "love screen able see video along cameras vivint smart home",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Absolutely Love the echo Show! It is in my kitchen. I love seeing my to do and shopping lists on there. My calendar is there too. Plus I scroll pictures on it from my Amazon prime photos. Love being able to get the daily news briefing from MPR every morning. Also use it for timing things. Would highly recommend it to Amazon prime members. Got it at a great price on sale prior to Christmas.",
      "processed": "absolutely love echo show kitchen love seeing shopping lists calendar plus scroll pictures amazon prime photos love able get daily news briefing mpr every morning also use timing things would highly recommend amazon prime members got great price sale prior christmas",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Amazon built upon the success of their Echo. I'm really enjoying the convenience of the Echo with the added display.",
      "processed": "amazon built upon success echo really enjoying convenience echo added display",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "I have put this in the kitchen to use for recipes and controlling various devices.",
      "processed": "put kitchen use recipes controlling various devices",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Not a very responsive program. Very limited information program. Not user friendly.",
      "processed": "responsive program limited information program user friendly",
      "sentiment": "negative",
      "confidence": 0.64
    },
    {
      "review": "The echo show is a great accessory to any house . It has a great picture on it and great sound . It‚Äôs simple to use . My wife uses it for recipes when cooking and making grocery lists . Also listens to music with crisp sound. Can ask Alexa pretty much anything .",
      "processed": "echo show great accessory house great picture great sound simple use wife uses recipes cooking making grocery lists also listens music crisp sound ask alexa pretty much anything",
      "sentiment": "positive",
      "confidence": 0.99
    },
    {
      "review": "The Amazon Echo Show is so much fun! I got it for my husband for Christmas and its absolutely more of a gift for myself! We also got hue lights and have set it up our routines. This show is so much fun! We listen to the news in the morning while making coffee, it wakes us up with slowly with the hue lights, we listen to music while cooking dinner... cant recommend it more! Because of this purchase, I am also buying a spot! We love the camera feature where you can \"drop in\" so we will continue buying these rather than the security cameras (for the inside at least where we just want to say hello or see our dog).",
      "processed": "amazon echo show much fun got husband christmas absolutely gift also got hue lights set routines show much fun listen news morning making coffee wakes us slowly hue lights listen music cooking dinner cant recommend purchase also buying spot love camera feature drop continue buying rather security cameras inside least want say hello see dog",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Worked better than expected! Highly recommend the Echo Show",
      "processed": "worked better expected highly recommend echo show",
      "sentiment": "positive",
      "confidence": 0.99
    },
    {
      "review": "I‚Äôve always loved the amazon Alexa smart products and use them to control my smart home setup.",
      "processed": "always loved amazon alexa smart products use control smart home setup",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "Purchased to stay in touch with family while traveling.",
      "processed": "purchased stay touch family traveling",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Love this product, able to read recipes instead of just hearing them. Speaker is pretty good too.",
      "processed": "love product able read recipes instead hearing speaker pretty good",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "I use the echo show to stream music, video chat, and drop in as a camera from my home. You can even see recipes and other items. Worth the money, got it on sale! I always wait for sales.",
      "processed": "use echo show stream music video chat drop camera home even see recipes items worth money got sale always wait sales",
      "sentiment": "positive",
      "confidence": 0.99
    },
    {
      "review": "at first I wasnt sure if this was something I \"needed\" when I already have the echo but it was on sale for black friday so I thought why not. As soon as it was set up I understood why I \"needed\" this. It just enhances everything Alexa does! Being able to see what she says is great! Seeing and adjusting my shopping list by touch is amazing. I love walking in the room and seeing little news blurbs. It looks sleek and beautiful on my counter. I highly recommend this to anyone.",
      "processed": "first wasnt sure something needed already echo sale black friday thought soon set understood needed enhances everything alexa able see says great seeing adjusting shopping list touch amazing love walking room seeing little news blurbs looks sleek beautiful counter highly recommend anyone",
      "sentiment": "positive",
      "confidence": 0.99
    },
    {
      "review": "Each and Every Version of Amazon Home Products have gotten better and better. This Amazon Home is the Cadillac of Amazon Home Products. The News Feed on the screen at all times along with the options and features that you can do with this is amazing. I love the ability to call my mom and dad and see what they are doing. They are only a couple of miles away but it is fun. I also love playing music on the device since most of songs include the words. You might find out that you have been singing the wrong lyrics for as long as you can remember.",
      "processed": "every version amazon home products gotten better better amazon home cadillac amazon home products news feed screen times along options features amazing love ability call mom dad see couple miles away fun also love playing music device since songs include words might find singing wrong lyrics long remember",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "I control all my smart home sthings with it, and also have 2 echo dots",
      "processed": "control smart home sthings also echo dots",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I LOVE MY ECHO SHOW, ELEXA IS SO HELPFULL SHE ANSWERS JUST ABOUT EVERY QUESTION I HAVE",
      "processed": "love echo show elexa helpfull answers every question",
      "sentiment": "positive",
      "confidence": 0.79
    },
    {
      "review": "I like the video feature for my doorbell. Wish it automatically showed a picture when door bell rung. Does not FaceTime. Maybe later. Also not all cameras are compatible.",
      "processed": "like video feature doorbell wish automatically showed picture door bell rung facetime maybe later also cameras compatible",
      "sentiment": "positive",
      "confidence": 0.985
    },
    {
      "review": "With a Seamless integration and easy functionality the echo show is wonderful piece of tech that is entertaining and useful to the whole family.",
      "processed": "seamless integration easy functionality echo show wonderful piece tech entertaining useful whole family",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Less than useless Does not work with Amazon CloudCam. I purchased this from Best Buy to allow me to monitor my two Cloud Cams from my kitchen. I am VERY tech savvy and have numerous Alexa devices but have been unable to get it to work. I tried installing and enabling the Amazon CloudCam Skill, made sure there were no new updates for the Show (the Show automatically updated when I first plugged it in). The final straw was when the tech support rep told me you can‚Äôt use the Show with the CloudCam‚Äîand then was unable to connect me with someone who could actually solve the problem. Useless is no help; less than useless actually makes more work. The Echo Show is less than useless.",
      "processed": "less useless work amazon cloudcam purchased best buy allow monitor two cloud cams kitchen tech savvy numerous alexa devices unable get work tried installing enabling amazon cloudcam skill made sure new updates show show automatically updated first plugged final straw tech support rep told use show unable connect someone could actually solve problem useless help less useless actually makes work echo show less useless",
      "sentiment": "negative",
      "confidence": 0.91
    },
    {
      "review": "I have the spot, dot and two shows, I started out with the spot and loved it so much I wanted a bigger one. This was a (Best Buy) ! No pun intended lol",
      "processed": "spot dot two shows started spot loved much wanted bigger one best buy pun intended lol",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "The Alexa show is a great product and the price was even better",
      "processed": "alexa show great product price even better",
      "sentiment": "positive",
      "confidence": 0.965
    },
    {
      "review": "I‚Äôm all about the smart home and I love my new echo show. I stay more connected with my family. I also love how it‚Äôs integrated with my Arlo, Ring, Nest, and Hue light bulbs.",
      "processed": "smart home love new echo show stay connected family also love integrated arlo ring nest hue light bulbs",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Love this! We have it on our kitchen counter and great for music, news updates, amazon delivery updates, recipes, timer, and soo much more!",
      "processed": "love kitchen counter great music news updates amazon delivery updates recipes timer soo much",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Tech is not totally friendly but for The cost and what it does it is worth the investment",
      "processed": "tech totally friendly cost worth investment",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Great product and it is very easy to set up and use",
      "processed": "great product easy set use",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Purchased for my mom in a memory care center. She doesn‚Äôt have to answer the phone, we simply drop in and start talking until she sees us. Picture clarity awesome! Staff also aware of this camera feature and knows we drop in frequently. Doesn‚Äôt replace room camera but good. Would give a 5 but can‚Äôt figure out how to have other alexa owners drop in on her. Anyone know?",
      "processed": "purchased mom memory care center answer phone simply drop start talking sees us picture clarity awesome staff also aware camera feature knows drop frequently replace room camera good would give figure alexa owners drop anyone know",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Works well with smart home lights, door locks and wireless security cam",
      "processed": "works well smart home lights door locks wireless security cam",
      "sentiment": "positive",
      "confidence": 0.855
    },
    {
      "review": "Great product. I‚Äôm at the beginning stages of having a smart home and this was the perfect addition.",
      "processed": "great product beginning stages smart home perfect addition",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Got this for my dad for Christmas. He likes that the speakers sound better. He also enjoys being able to make video calls with it.",
      "processed": "got dad christmas likes speakers sound better also enjoys able make video calls",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I like having the screen and being able to see things like weather reports, etc. Still not using it to its full potential, but we have it controlling a couple of lamps, giving us weather reports, setting timers and alarms. It's making me lazy! Sometimes it doesn't hear my voice. Hears my husband's voice better. I find it best to put it pretty close to me on a side table.",
      "processed": "like screen able see things like weather reports etc still using full potential controlling couple lamps giving us weather reports setting timers alarms making lazy sometimes hear voice hears husband voice better find best put pretty close side table",
      "sentiment": "positive",
      "confidence": 0.96
    },
    {
      "review": "I am loving my Amazon Echo Show. It makes life easier! I love being able to ask what the weather is going to be or play some music just by asking Alexa. I also love being able to video call friends and family that have an Echo Show or the Alexa App. Overall it is a great product!",
      "processed": "loving amazon echo show makes life easier love able ask weather going play music asking alexa also love able video call friends family echo show alexa app overall great product",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "It is a great product. It works great would definitely recommend it to anyone wanting to buy one.",
      "processed": "great product works great would definitely recommend anyone wanting buy one",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "So having Alexa on hand could be good and bad. It's nice when I'm cooking and I need help with a recipe but it can be annoying when my kids fight over what they want Alexa to answer. Over all it's a nice product, connects to my Ring doorbell too which is nice.",
      "processed": "alexa hand could good bad nice cooking need help recipe annoying kids fight want alexa answer nice product connects ring doorbell nice",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "The Echo show is addictive. Pairs easy, fantastic sound and video and once you download the Alexa app and learn a few things it becomes indispensable. Video calls work well. Great for the office or Kitchen.",
      "processed": "echo show addictive pairs easy fantastic sound video download alexa app learn things becomes indispensable video calls work well great office kitchen",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I like the Echo Show. I can view my cams, watch a movie and read the news. The camera video is slightly delayed. And I do wish it had a jack for earphones. But the sound on mine is good.",
      "processed": "like echo show view cams watch movie read news camera video slightly delayed wish jack earphones sound mine good",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I like that you can Talk To Alexa. I like the lyrics to the music. I like the personal Assistant, It is So wonderful and limitless.",
      "processed": "like talk alexa like lyrics music like personal assistant wonderful limitless",
      "sentiment": "positive",
      "confidence": 0.94
    },
    {
      "review": "User friendly, hand free little assistant. Makes your mornings easier and gets you started for the day. And it looks cool",
      "processed": "user friendly hand free little assistant makes mornings easier gets started day looks cool",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "This has been perfect for the kitchen, it plays music & I can sing along with the words on the screen. Love that Alexa also allows for multiple timer settings when cooking.",
      "processed": "perfect kitchen plays music sing along words screen love alexa also allows multiple timer settings cooking",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Echo Show is a great tool in the kitchen. Paired with amazon music it makes the time go by quickly. Video selection could be better (somehow needs to strike a deal with Google for access to YouTube video). It does have nice video for recipes.",
      "processed": "echo show great tool kitchen paired amazon music makes time go quickly video selection could better somehow needs strike deal google access youtube video nice video recipes",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "Amazon's Echo Show has been a great help to my daily rutine. From asking simple things like the weather to more specific things like flash briefings or traffic to my commute, echo show is a great tool for any tech enthusiast",
      "processed": "amazon echo show great help daily rutine asking simple things like weather specific things like flash briefings traffic commute echo show great tool tech enthusiast",
      "sentiment": "positive",
      "confidence": 0.98
    },
    {
      "review": "I‚Äôm in love with Alexa. Love her fir music, quick weather updates and in the kitchen for recipes. It‚Äôs great getting them step by step and not having to keep putting the passcode in on my iPad with hands covered in flour.",
      "processed": "love alexa love fir music quick weather updates kitchen recipes great getting step step keep putting passcode ipad hands covered flour",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Bought as a gift for my wife, she loves it and the screen is very handy for recipes and such.",
      "processed": "bought gift wife loves screen handy recipes",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "She knows all the answers. I‚Äôm used to speaking to her, i recently visiting a friend and said ‚ÄúAlexa ‚Äú. And my friend looked at me like I was crazy. She doesn‚Äôt have Alexa.",
      "processed": "knows answers used speaking recently visiting friend said friend looked like crazy alexa",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "It is great to be able to make video calls from the kitchen. Very convenient.",
      "processed": "great able make video calls kitchen convenient",
      "sentiment": "positive",
      "confidence": 0.99
    },
    {
      "review": "Needs to be a stand alone device. I should have not required to use a tablet of Cell phone to make it work. Amazon needs to work on the technology on device.",
      "processed": "needs stand alone device required use tablet cell phone make work amazon needs work technology device",
      "sentiment": "negative",
      "confidence": 0.86
    },
    {
      "review": "This was bought for a gift. But it looks nice. Just what was expected",
      "processed": "bought gift looks nice expected",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "I have not used this as it is a gift for my parents. Will see how they like it.",
      "processed": "used gift parents see like",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "a bit difficult to set up, but it is amazing. Love the screen!",
      "processed": "bit difficult set amazing love screen",
      "sentiment": "positive",
      "confidence": 0.985
    },
    {
      "review": "with this echo line, we are able to watch amazon prime, and even do visual calls to grand daughter!",
      "processed": "echo line able watch amazon prime even visual calls grand daughter",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "Great to give as gifts. I bought several items for staff.",
      "processed": "great give gifts bought several items staff",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I have several around the house and love playing music on them",
      "processed": "several around house love playing music",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "I bought this as a gift for my husband and he is constantly asking Alexa questions about everything. We love listening to music on it as well.",
      "processed": "bought gift husband constantly asking alexa questions everything love listening music well",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "The touch screen adds a new dimension to the Echo which comes in handy when ordering off of Amazon or reorders as well. I also like being able to view news briefings and song lyrics on the screen also. The Echo Show is the only way to go.",
      "processed": "touch screen adds new dimension echo comes handy ordering amazon reorders well also like able view news briefings song lyrics screen also echo show way go",
      "sentiment": "positive",
      "confidence": 0.99
    },
    {
      "review": "The Echo show screen is great, it is helpful with recipes, music etc. I use it to listen to music all the time. I am hoping someone in my family gets one soon so we can face time each other.",
      "processed": "echo show screen great helpful recipes music etc use listen music time hoping someone family gets one soon face time",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "I bought the echo after seeing it demonstrated by my brother. He proceeded to ask Alexa questions and Alexa would answer them immediately. He then asked it to pull up some songs which, it did right away. Then he asked it to call mom and it did that as well. Needless to say, i had to get one.",
      "processed": "bought echo seeing demonstrated brother proceeded ask alexa questions alexa would answer immediately asked pull songs right away asked call mom well needless say get one",
      "sentiment": "positive",
      "confidence": 0.98
    },
    {
      "review": "We bought two of these for the kids. They love them and I now have an echo dot",
      "processed": "bought two kids love echo dot",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I have to say it was a little confusing and frustrating when i was not getting the verification code from amazon , i waited for 20 minutes then i requested another code, nothing... then a nother one... and still nothing , i started to set up the device at 8.30 am and by 11.20 am i was fed up with it.. i had to step away.... after about 5 hours we went shopping and at the mall i recieved about 4 codes from amazon ....",
      "processed": "say little confusing frustrating getting verification code amazon waited minutes requested another code nothing nother one still nothing started set device fed step away hours went shopping mall recieved codes amazon",
      "sentiment": "negative",
      "confidence": 0.91
    },
    {
      "review": "I. Like the visual with this echo although I think I would have enjoyed it more if this was my first and only alexa",
      "processed": "like visual echo although think would enjoyed first alexa",
      "sentiment": "positive",
      "confidence": 0.98
    },
    {
      "review": "I bought this device for my wife and she loves it. Plays videos for cooking. 1 on gift list. For sure.",
      "processed": "bought device wife loves plays videos cooking gift list sure",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "We use this as a monitor for the amazon cloud camera! Works great we tell it to show us the camera ,and boom, there‚Äôs the video feed. Super easy to link our echo plus and the echo dot with the show!!",
      "processed": "use monitor amazon cloud camera works great tell show us camera boom video feed super easy link echo plus echo dot show",
      "sentiment": "positive",
      "confidence": 0.99
    },
    {
      "review": "The Echo Show is great but it is not just plug and play. The app directions are not understandable if you are having problems. However, the Amazon hot line was very helpful. But, who wants to have to call for help every week or two to keep things running. Alexa should be able to talk you through how to resolve her issues. All in all I am getting used to the features and like it.",
      "processed": "echo show great plug play app directions understandable problems however amazon hot line helpful wants call help every week two keep things running alexa able talk resolve issues getting used features like",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Alexa runs my entire house. The Echo show is a great addition to the Echo family. Everyone needs one!",
      "processed": "alexa runs entire house echo show great addition echo family everyone needs one",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Staff was very helpful and polite ! Went in asked for help and was pointed in the right direction!",
      "processed": "staff helpful polite went asked help pointed right direction",
      "sentiment": "positive",
      "confidence": 0.98
    },
    {
      "review": "Absolutely love this. We got the lights and they have worked so great.",
      "processed": "absolutely love got lights worked great",
      "sentiment": "positive",
      "confidence": 0.98
    },
    {
      "review": "Great Smart speaker for my 90 year old mother in law.",
      "processed": "great smart speaker year old mother law",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I‚Äôm an amazon prime member and the show is awsum I use it to communicate with the son who lives in Seattle. You can watch amazon pirime tv,play amazon music. Text, play games read the lyrics while the song is playing. I love it",
      "processed": "amazon prime member show awsum use communicate son lives seattle watch amazon pirime tv play amazon music text play games read lyrics song playing love",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "We loved the Echo Dot, but the Show is exponentially better. Especially love to see the words of the songs being played, and views of places all over the world we want to see. Big difference in cost between dot and show, but worth it!",
      "processed": "loved echo dot show exponentially better especially love see words songs played views places world want see big difference cost dot show worth",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Love the new echo show. has so many more features that my echo dot.",
      "processed": "love new echo show many features echo dot",
      "sentiment": "positive",
      "confidence": 0.975
    },
    {
      "review": "I had been looking for the product for a while. After much research, I bought it and I am not disappointed. It is a great product. I can tell I won't be bored learning all that the echo show can do. If you're thinking about buying it, just go for it.",
      "processed": "looking product much research bought disappointed great product tell wo bored learning echo show thinking buying go",
      "sentiment": "positive",
      "confidence": 0.965
    },
    {
      "review": "The Amazon Show is a great addition to the Smart Home, easy to set up and to link up with a hub.",
      "processed": "amazon show great addition smart home easy set link hub",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Like having pictures and weather on the screen and news up dates",
      "processed": "like pictures weather screen news dates",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "It does everything amazon, and I can even see who is at the front door with Arlo! It doesn't do Netflix, or Hulu, but that's okay. I really like the sound, it fills small rooms. It's easy now to video chat with Nana, or drop in to tell my kid's goodnight, when I am working late.",
      "processed": "everything amazon even see front door arlo netflix hulu okay really like sound fills small rooms easy video chat nana drop tell kid goodnight working late",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "Facilitates easy home set-up of many Smart devices.",
      "processed": "facilitates easy home many smart devices",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I have really enjoyed these products so much I actually bought 3 of them. Fun to watch and even better if you are an Amazon Prime customer for music and video.",
      "processed": "really enjoyed products much actually bought fun watch even better amazon prime customer music video",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "Great electronic , very easy to install me and my family enjoy the things that Alexa do very satisfied with my service that I received from Best Buy when I purchase it looking forward to shopping there more often and I'm a new customer there",
      "processed": "great electronic easy install family enjoy things alexa satisfied service received best buy purchase looking forward shopping often new customer",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "The show has some nice features but the audio quality isn‚Äôt the best for the price point. I got mine on sale and am just using it for a bedroom alarm clock. I can read the time without my glasses.I still use my Sonos Play 1 to listen to my sleep playlist and ny other music. Unless I missed something it seems like if I set the volume low at night to listen to music to go to sleep my alarm will not be loud enough. So I don‚Äôt use the Show for music much.",
      "processed": "show nice features audio quality best price point got mine sale using bedroom alarm clock read time without still use sonos play listen sleep playlist ny music unless missed something seems like set volume low night listen music go sleep alarm loud enough use show music much",
      "sentiment": "neutral",
      "confidence": 0.66
    },
    {
      "review": "Setting up the amazon show was a little tricky,but I managed to navigate through it. It‚Äôs so cool to add compatible equipment.",
      "processed": "setting amazon show little tricky managed navigate cool add compatible equipment",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Great for video calling grandparents who are not real tech savvy. They also enjoy music on demand.",
      "processed": "great video calling grandparents real tech savvy also enjoy music demand",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Requires too many components. Cameras, etc. stick with basics (in my opinion).",
      "processed": "requires many components cameras etc stick basics opinion",
      "sentiment": "neutral",
      "confidence": 0.75
    },
    {
      "review": "We are loving it so far! Bought with a great deal and was able to use previous best buy awards to get it cheap. We also ended up buying another one for the parents for Christmas so we can chat back and forth! I love how all the echo's connect now in our home.",
      "processed": "loving far bought great deal able use previous best buy awards get cheap also ended buying another one parents christmas chat back forth love echo connect home",
      "sentiment": "positive",
      "confidence": 0.99
    },
    {
      "review": "I am so happy to have the Echo Show. I have been able to listen to Christmas songs and some country western music. It has so many other things to do with it that I can not wait to try some.",
      "processed": "happy echo show able listen christmas songs country western music many things wait try",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "When I purchased this item, I was unaware how much it really does. I can literally control my entire home with it.",
      "processed": "purchased item unaware much really literally control entire home",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Echo Show is everything I thought it would be and more. The alarm and music actions are the greatest.",
      "processed": "echo show everything thought would alarm music actions greatest",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "We wanted to see how this would work and it's not super accurate, but kind of fun",
      "processed": "wanted see would work super accurate kind fun",
      "sentiment": "neutral",
      "confidence": 0.62
    },
    {
      "review": "We have Alexa and now a video version of recipes and more. Love it!",
      "processed": "alexa video version recipes love",
      "sentiment": "positive",
      "confidence": 0.985
    },
    {
      "review": "Ok so i normally do not like this kind of stuff, but to be honest Alexa has been great, not only do we use it for fun stuff like music while cooking, or being able to multi task much easier, it fit in seamlessly with our home security system, added a extra cam, and really does add something extra to the home",
      "processed": "ok normally like kind stuff honest alexa great use fun stuff like music cooking able multi task much easier fit seamlessly home security system added extra cam really add something extra home",
      "sentiment": "positive",
      "confidence": 0.965
    },
    {
      "review": "Video integration it's big plus for video calling kids at home and quick check who's at the door when doorbell rings.",
      "processed": "video integration big plus video calling kids home quick check door doorbell rings",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "The show has a good picture and good sound...love using it to look things up",
      "processed": "show good picture good sound love using look things",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I bought this as a gift. As far as know it works fine",
      "processed": "bought gift far know works fine",
      "sentiment": "positive",
      "confidence": 0.985
    },
    {
      "review": "The unit does a good job of playing music from Amazon music. It hears your voice very good although it gets confused at times when I tell it to turn on a particular lamp and I have to slowly pronunciate it. Like that the music shows the lyrics. Do need a family account on Amazon music to plan different music on different units in different rooms at the same time though.",
      "processed": "unit good job playing music amazon music hears voice good although gets confused times tell turn particular lamp slowly pronunciate like music shows lyrics need family account amazon music plan different music different units different rooms time though",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "I had reservations for the purchase of this Echo show, they quickly eroded after setting it up and using it now since Christmas day. Everyone in my family loves the camera function, sound quality, picture resolution and basically everything about it!It isn't totally perfected yet but it is a work in progress when it comes to the skills and how you choose to use this device since it is definitely designed for Amazon and their customers. Versatile enough so that everyone could find something to enjoy from music, pictures, videos to having your favorite book read to you. One of my favorite features are the Ole time radio series offered in the skills. Takes you back in time as you relax and very similar to a good book. Just my preference and it does offer much more and new skills are daily being added. Although we have several echo dots everywhere, my 6yo loves to come to the echo show to hear her music or to see new pictures uploaded to our cloud. The sound is amazing for its size, that's a huge plus. Pictures are dynamic and so far the only issue with me anyway is it's shape. Slightly odd but it seems to blend into our decor pretty well. Hopefully newer and even better skills will be made as this is a real gem in the rough with tons of applications still ahead that it can be used for. I have it connected to our home security system, robot vacuum cleaner and at times to my cell phone. Taken all together it is useful, fun and a nice addition for our gadget loaded home.",
      "processed": "reservations purchase echo show quickly eroded setting using since christmas day everyone family loves camera function sound quality picture resolution basically everything totally perfected yet work progress comes skills choose use device since definitely designed amazon customers versatile enough everyone could find something enjoy music pictures videos favorite book read one favorite features ole time radio series offered skills takes back time relax similar good book preference offer much new skills daily added although several echo dots everywhere loves come echo show hear music see new pictures uploaded cloud sound amazing size huge plus pictures dynamic far issue anyway shape slightly odd seems blend decor pretty well hopefully newer even better skills made real gem rough tons applications still ahead used connected home security system robot vacuum cleaner times cell phone taken together useful fun nice addition gadget loaded home",
      "sentiment": "positive",
      "confidence": 0.985
    },
    {
      "review": "Added screen a great features visual effect a plus",
      "processed": "added screen great features visual effect plus",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "We use echo almost every day. It is fun to ask questions. The music is great. We check the weather and listen to NPRnews",
      "processed": "use echo almost every day fun ask questions music great check weather listen nprnews",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I picked up the show on a Black Friday deal. I probably would never have paid full price. I am glad I have the show, it is actually quite useful. The sound quality is also better than the standard echo. At the moment, my only complaints are the lack of YouTube support and the price.. It will be interesting to see what features Amazon will add to the show in the future.",
      "processed": "picked show black friday deal probably would never paid full price glad show actually quite useful sound quality also better standard echo moment complaints lack youtube support price interesting see features amazon add show future",
      "sentiment": "positive",
      "confidence": 0.975
    },
    {
      "review": "This is an awesome product. This is the first Echo product I owned and I purchased 2 to get $100 off. I was going to split with a friend but like this so much that I decided to keep both. I've being singing along with the stream song with lyrics while doing work in the kitchen and house and watching youtube videos. The videos on Youtube takes a more effort to find the ones I want but I think this will improve over time.",
      "processed": "awesome product first echo product owned purchased get going split friend like much decided keep singing along stream song lyrics work kitchen house watching youtube videos videos youtube takes effort find ones want think improve time",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I love all of my Amazon echo devices. Right now it doesn't allow YouTube, but hopefully they will reach an agreement and fix that.",
      "processed": "love amazon echo devices right allow youtube hopefully reach agreement fix",
      "sentiment": "positive",
      "confidence": 0.85
    },
    {
      "review": "I love the show. It was so easy to set up. I use it every day for music and weather info. Can'y wait to see how it works for Christmas cookies.",
      "processed": "love show easy set use every day music weather info wait see works christmas cookies",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "I am totally Addicted.Easy to use. Love the call feature.",
      "processed": "totally use love call feature",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "The sales associate was knowledgeable enough to lead me in the right direction in purchasing this product that‚Äôs compatible with my mother‚Äôs Arlo Security cameras. It works great!",
      "processed": "sales associate knowledgeable enough lead right direction purchasing product compatible arlo security cameras works great",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "The first thing we noticed was Alexa‚Äôs response time to questions. No waiting or downloading just lightning quick responses. 2nd was the compatibility with our smart hone features. She connects to our lights and security monitoring system with ease. She is clear and concise.",
      "processed": "first thing noticed response time questions waiting downloading lightning quick responses compatibility smart hone features connects lights security monitoring system ease clear concise",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Product is great. It is Easy to use and easy to set up",
      "processed": "product great easy use easy set",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "This is a helpful addition to the home. It's great to be able to set timers, play music, and check the news all hands free.",
      "processed": "helpful addition home great able set timers play music check news hands free",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Alexa can make you crazy but it‚Äôs worth the aggravation.",
      "processed": "alexa make crazy worth aggravation",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "This does the same things as the other echos but has a screen. The sound is comparable to the echo which is good. The screen is small, not hd, and not touch screen. You only can call other echo users.If you have an echo don't run out and buy you can do all on a laptop. If you are looking at an echo having the screen might be worth the extra bucks,",
      "processed": "things echos screen sound comparable echo good screen small hd touch screen call echo echo run buy laptop looking echo screen might worth extra bucks",
      "sentiment": "neutral",
      "confidence": 0.635
    },
    {
      "review": "Upgraded from echo to this and this is just what I needed. Works well with my new Ring door bell and security cameras. Love the versatility of this.",
      "processed": "upgraded echo needed works well new ring door bell security cameras love versatility",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "Alexa is great and even better with a screen to show you all your searches and videos",
      "processed": "alexa great even better screen show searches videos",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "First bought the Dot to see if we liked it. We enjoyed it, but wanted a little more volume. When I saw that the Show was much louder and had the camera we decided it was the right choice. Now we have the Dot in the bedroom and the Show in the living room. For larger rooms the Show is a great choice.",
      "processed": "first bought dot see liked enjoyed wanted little volume saw show much louder camera decided right choice dot bedroom show living room larger rooms show great choice",
      "sentiment": "positive",
      "confidence": 0.99
    },
    {
      "review": "Great product will recommend it to friends and family.",
      "processed": "great product recommend friends family",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I was hesitant, and I am now hooked. This is both fun and useful",
      "processed": "hesitant hooked fun useful",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "The Show sounds significantly better than the echo plus. And the added screen features are nice. I just wish the ‚Äúthings to try section‚Äù would go away",
      "processed": "show sounds significantly better echo plus added screen features nice wish try would go away",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "This Amazon Echo is very user friendly, and provides hours of entertainment, with anything from recipes, news, videos, and Amazon music with the lyrics is like having your own Karaoke.",
      "processed": "amazon echo user friendly provides hours entertainment anything recipes news videos amazon music lyrics like karaoke",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "great product with many functions I would highly recommend it to a friend.",
      "processed": "great product many functions would highly recommend friend",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Device must be studied and practiced with to gain max use of its robust capacity .",
      "processed": "device must studied practiced gain max use robust capacity",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "We bought the Echo Show to get the hyped benefits of Alexa, and home automation. After using for a week, we decided to return the Echo Show. Alexa just isn't ready for prime time. 90% of the time we got the \"I can't answer that\" response to questions. It's a waste of money for us. Say \"Alexa, Say good bye!\"",
      "processed": "bought echo show get hyped benefits alexa home automation using week decided return echo show alexa ready prime time time got ca answer response questions waste money us say alexa say good bye",
      "sentiment": "positive",
      "confidence": 0.77
    },
    {
      "review": "This product ties in to the Amazon ecosystem better than the Dot or Echo. It provides better sound quality and plays video. Pairing this off with Nest cameras has been the best. So quick and easy. I highly recommend this product.",
      "processed": "product ties amazon ecosystem better dot echo provides better sound quality plays video pairing nest cameras best quick easy highly recommend product",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Alexa can do it all! Having a severe hearing loss, the 'Show' gives me visuals along with captions so that I can follow what Alexa is saying!",
      "processed": "alexa severe hearing loss gives visuals along captions follow alexa saying",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "The Echo show with video screen is a nice upgrade to the other echo‚Äôs. News briefs with videos are nice. Very good sound quality for playing music.",
      "processed": "echo show video screen nice upgrade news briefs videos nice good sound quality playing music",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "This is the only one you need ! it's like having the Dot, Echo and IHome all in one with a screen !",
      "processed": "one need like dot echo ihome one screen",
      "sentiment": "positive",
      "confidence": 0.99
    },
    {
      "review": "So great to instantly see family members to chat, demonstrate, check-in... PLUS all the wonderful features of the Echo devices including video clips, movies, etc .",
      "processed": "great instantly see family members chat demonstrate plus wonderful features echo devices including video clips movies etc",
      "sentiment": "positive",
      "confidence": 0.965
    },
    {
      "review": "It is amaizin I like the way you type and search my favorites",
      "processed": "amaizin like way type search favorites",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "This has quickly become one of the most used at the kitchen counter! If you have Alexa an you like it, a must have upgrade.",
      "processed": "quickly become one used kitchen counter alexa like must upgrade",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "This is our second Show. And, one of several Christmas gifts. These are convenient and fun! Easy to set up. We use our Alexa devices as whole house intercom and for listening to music.",
      "processed": "second show one several christmas gifts convenient fun easy set use alexa devices whole house intercom listening music",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I use Alexa every day. I do not know how I lived with out her before",
      "processed": "use alexa every day know lived",
      "sentiment": "positive",
      "confidence": 0.99
    },
    {
      "review": "We purchased the Amazon - Echo Show with Alexa in store. Took it home and after connection wi-fi it was great. we cannot wait to buy light bulbs and a thermostat. Great buy",
      "processed": "purchased amazon echo show alexa store took home connection great wait buy light bulbs thermostat great buy",
      "sentiment": "positive",
      "confidence": 0.97
    },
    {
      "review": "Does exactly what we wanted it to do. Very easy voice commands.",
      "processed": "exactly wanted easy voice commands",
      "sentiment": "positive",
      "confidence": 0.79
    },
    {
      "review": "Love this new Echo Show.The best in the Alexa family",
      "processed": "love new echo best alexa family",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Bought the eco show to replace my first gen eco (the original tube). The show hears and understands me a lot better.",
      "processed": "bought eco show replace first gen eco original tube show hears understands lot better",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "I love my Alexa Show. It can answer most of my questions and I use it for recipes and listening to music. I use it everyday.",
      "processed": "love alexa show answer questions use recipes listening music use everyday",
      "sentiment": "positive",
      "confidence": 0.99
    },
    {
      "review": "The screen is a great upgrade. Music lyrics are displayed with good quality speakers. Very convenient for recipes and you can make hands free calls with great audio quality. Great product!",
      "processed": "screen great upgrade music lyrics displayed good quality speakers convenient recipes make hands free calls great audio quality great product",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "I bought the Echo Show because a friend of mine was excited about his. I'm hoping it makes a great Christmas present for our family.",
      "processed": "bought echo show friend mine excited hoping makes great christmas present family",
      "sentiment": "positive",
      "confidence": 0.98
    },
    {
      "review": "I bought the white version and have it in the kitchen. I use it for EVERYTHING, music, video, phone, security cams, news, weather. It's the perfect kitchen assistant.",
      "processed": "bought white version kitchen use everything music video phone security cams news weather perfect kitchen assistant",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "BUY IT !The video adds great value to the songs, news, etc.Also, accessing videos such as Netflix adds greatly.",
      "processed": "buy video adds great value songs news accessing videos netflix adds greatly",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "The echo show feels useless after a few hours, especially without the ability to watch YouTube.",
      "processed": "echo show feels useless hours especially without ability watch youtube",
      "sentiment": "positive",
      "confidence": 0.63
    },
    {
      "review": "This device is especially useful if you know others who own it. It offers the same features as the standard Echo, along with an expanded feature set as well.",
      "processed": "device especially useful know others offers features standard echo along expanded feature set well",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "My entire family loves this product. We ask her questions and go to sleep with her playing music. You feel like you have company anytime you want",
      "processed": "entire family loves product ask questions go sleep playing music feel like company anytime want",
      "sentiment": "positive",
      "confidence": 0.985
    },
    {
      "review": "This is a must have is great for recepies, while you are cooking Alexa gives you the info. For the ines that are used to a tablet or iPod that you have to stop and read this is awesome plus. So much easier to follow things.",
      "processed": "must great recepies cooking alexa gives info ines used tablet ipod stop read awesome plus much easier follow things",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Got this for two days during the holidays. Very good service",
      "processed": "got two days holidays good service",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Amazon - Echo Show is the best of all my Amazon products. I love the hands-free but able to see things on the screen.",
      "processed": "amazon echo show best amazon products love able see things screen",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I love this thing! It‚Äôs so fun and easy to use. My 3 year old even uses it to play the trolls or lion king soundtrack",
      "processed": "love thing fun easy use year old even uses play trolls lion king soundtrack",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Love having this in my kitchen. Play music, ask questions, make list, set timers, etc.",
      "processed": "love kitchen play music ask questions make list set timers etc",
      "sentiment": "positive",
      "confidence": 0.99
    },
    {
      "review": "Overall works well. Sound better than dot. Screen is clear.",
      "processed": "overall works well sound better dot screen clear",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "9the screen doesn't show as much as I thought it would but it works great and the speaker seems good on it.",
      "processed": "screen show much thought would works great speaker seems good",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I haven‚Äôt used this yet, it is a gift for my father but I think he‚Äôll love it.",
      "processed": "used yet gift father think love",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "I own a dot and a first gen echo and the sound from the show is way better than both of my other echoes. The video functions are nice but it is a pain to get it to play videos from my Amazon library. My family enjoys the calendar info and the news briefings that rotate on the screen.",
      "processed": "dot first gen echo sound show way better echoes video functions nice pain get play videos amazon library family enjoys calendar info news briefings rotate screen",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Video calls work great and the screen is super informative.",
      "processed": "video calls work great screen super informative",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I resisted getting this since I already have two Echo units and one Dot. Black Friday gave me reason to buy one. I LOVE IT twice as much as the regular Echo. The set up is faster and easier and I love the visuals. I use my Shopping List and To Do List A LOT and having it display and being able to edit it without logging into the app makes it so much more worth it. I may be getting another :)",
      "processed": "resisted getting since already two echo units one dot black friday gave reason buy one love twice much regular echo set faster easier love visuals use shopping list list lot display able edit without logging app makes much worth may getting another",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Very easy to set up and use. Really like the screen to view the items searched for, and to read information about the searched item.",
      "processed": "easy set use really like screen view items searched read information searched item",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I recommended is very good and practice. Play music is very good quality speaker I see video. I love",
      "processed": "recommended good practice play music good quality speaker see video love",
      "sentiment": "positive",
      "confidence": 0.95
    },
    {
      "review": "Love playing music and talking to Alexa and looking at my camera three the screen",
      "processed": "love playing music talking alexa looking camera three screen",
      "sentiment": "positive",
      "confidence": 0.945
    },
    {
      "review": "This product will for sure come in handy. Very easy to use. Precise,accurate,and knowledgeable.",
      "processed": "product sure come handy easy use precise accurate knowledgeable",
      "sentiment": "positive",
      "confidence": 0.965
    },
    {
      "review": "Just an average Alexa option. Does show a few things on screen but still limited.",
      "processed": "average alexa option show things screen still limited",
      "sentiment": "neutral",
      "confidence": 0.89
    },
    {
      "review": "The amazon Show has to be one of the best smart home devices that every came out. Alexa, Videos, music, and drop in. Amazing product!!!",
      "processed": "amazon show one best smart home devices every came alexa videos music drop amazing product",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "I had the Echo previously, but having the screen opens up more options for Alexa. I find it helpful to be able to glance at the screen and see things like time and weather. I also have cameras setup and I can use Alexa to view these feeds. While the unit is kind of large, it is stable and supports touch. I haven't tried video calling or playing videos, but the screen quality seems pretty good.",
      "processed": "echo previously screen opens options alexa find helpful able glance screen see things like time weather also cameras setup use alexa view feeds unit kind large stable supports touch tried video calling playing videos screen quality seems pretty good",
      "sentiment": "positive",
      "confidence": 0.93
    },
    {
      "review": "Best New Adult Toy in years! Wish I had purchased one for my parents. LOVE IT!!!!",
      "processed": "best new adult toy years wish purchased one parents love",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "I own multiple echoes and I like the show the best. The screen adds a lot of value in my opinion. I really like being able to see upcoming calendar events and daily news. My kids like watching cartoons from Amazon Prime while eating breakfast. The speakers are great and put out more than enough quality sound for their size. At $149 it was a great deal.",
      "processed": "multiple echoes like show best screen adds lot value opinion really like able see upcoming calendar events daily news kids like watching cartoons amazon prime eating breakfast speakers great put enough quality sound size great deal",
      "sentiment": "positive",
      "confidence": 0.975
    },
    {
      "review": "I bought several Alexa‚Äôs for Christmas gifts also for myself also bought Amazon Show for Christmas gift also for a my youngest Daugter !",
      "processed": "bought several christmas gifts also also bought amazon show christmas gift also youngest daugter",
      "sentiment": "positive",
      "confidence": 0.985
    },
    {
      "review": "This one is the best...I have the dots but this is so nice if you have cameras just ask for that camera and you will get it on the screen.. spend the extra ..",
      "processed": "one best dots nice cameras ask camera get screen spend extra",
      "sentiment": "positive",
      "confidence": 0.985
    },
    {
      "review": "My wife said I‚Äôm developing a ‚ÄúStar Trek‚Äù home...while I‚Äôm still learning what all I can do with this over the regular Echo, I am looking forward to getting my Ring Doorbell installed! Great product, I can rave enough about them!!!",
      "processed": "wife said developing home still learning regular echo looking forward getting ring doorbell installed great product rave enough",
      "sentiment": "positive",
      "confidence": 1.0
    }
  ]
}