{
  "product_id": "B00IOY8XWQ",
  "product_info": {
    "name": "Amazon - Kindle Voyage - 6\" - 4GB - Black",
    "brand": "Amazon",
    "category": "Electronics",
    "id": "B00IOY8XWQ",
    "url": "https://www.amazon.com/dp/B00IOY8XWQ"
  },
  "timestamp": "2024-12-04T19:07:14.213928",
  "summary": {
    "overall_sentiment": "positive",
    "confidence_score": 0.9729878048780487,
    "review_counts": {
      "positive": 79,
      "neutral": 2,
      "negative": 1
    },
    "recommendation": "Highly recommended based on consistently positive reviews."
  },
  "detailed_analysis": [
    {
      "review": "I had an older version of a Kindle e-reader that allowed me to download books on the go, but I felt like something was missing. Several upgrades later, I got this for a gift, and I think it basically includes everything that was missing. It is so lightweight and compact that I can easily slip it into my purse or use it with one hand. It has backlighting that doesn't disturb my sleeping husband or create a light so bright that it is distracting- it's just the right amount of light needed to read in different ligths. It can self-adjust from reading in a dark room to reading outside on a bright day.",
      "processed": "older version kindle allowed download books go felt like something missing several upgrades later got gift think basically includes everything missing lightweight compact easily slip purse use one hand backlighting disturb sleeping husband create light bright right amount light needed read different ligths reading dark room reading outside bright day",
      "sentiment": "positive",
      "confidence": 0.96
    },
    {
      "review": "so far so good,,,, wife very happy. misses her old one....",
      "processed": "far good wife happy misses old one",
      "sentiment": "positive",
      "confidence": 0.985
    },
    {
      "review": "Excellent Ereader if that is all you are looking for. Probably a bit over priced for the casual reader, the Voyage is wonderful for those looking for the best reading experience and are willing to pay the price tag and trade the lack of functionality.",
      "processed": "excellent ereader looking probably bit priced casual reader voyage wonderful looking best reading experience willing pay price tag trade lack functionality",
      "sentiment": "positive",
      "confidence": 0.96
    },
    {
      "review": "I have an old Kindle Touch, the last one that still had text-to-voice, which no longer works. I decided to upgrade, started reading the reviews, was enticed by the The Kindle Voyage and took the plunge. The Voyage is pretty and sleek, with neat features, and I enjoyed using it for a few days, but my frugal self just couldn't justify the price difference between it and the PaperWhite. While the ambient light sensor was nice, I often ended up just adjusting it manually because it was still a little bright in a completely dark room. I made more errors of turning a page than I meant to with the \"page turn\" because of where the page turn spots are located, plus, I'm in the habit of flipping pages on the phone or a tablet, so I kept swiping despite the availability of page turn. However, the clarity of the screen, the quality of the light, the form factor, the weight and the way it felt in my hand while reading were all very nice. Nonetheless, the price difference bothered me enough to return it and get the Paperwhite. The thing I miss most about the Voyage is the quality of the light, and how even the lighting is on it. The unit I had did not have blank spots or a yellowish top half of the page, or any of the lighting issues some reviewers mentioned with the Voyage. I purchased the newest model of the Paperwhite and I like it, but the lighting appears pretty dingy. However, it's only when they're compared side-to-side that I wished I wasn't so cost conscious. If money is not an object, I'd say get the Kindle Voyage, if it is, the Paperwhite is a fine little reader, and overall I'm happy I have it.",
      "processed": "old kindle touch last one still longer works decided upgrade started reading reviews enticed kindle voyage took plunge voyage pretty sleek neat features enjoyed using days frugal self could justify price difference paperwhite ambient light sensor nice often ended adjusting manually still little bright completely dark room made errors turning page meant page turn page turn spots located plus habit flipping pages phone tablet kept swiping despite availability page turn however clarity screen quality light form factor weight way felt hand reading nice nonetheless price difference bothered enough return get paperwhite thing miss voyage quality light even lighting unit blank spots yellowish top half page lighting issues reviewers mentioned voyage purchased newest model paperwhite like lighting appears pretty dingy however compared wished cost conscious money object say get kindle voyage paperwhite fine little reader overall happy",
      "sentiment": "positive",
      "confidence": 0.94
    },
    {
      "review": "this kindle is very light so easy to hold for a long time without getting tired - worth upgrading your older version kindle...",
      "processed": "kindle light easy hold long time without getting tired worth upgrading older version kindle",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I or a family member have owned every version of the Kindle since it came out. This version has finally taken all of the best elements of the previous Kindles and combined them into one unit. It is small and light, has both touch screen and button functionality (depending on which you prefer - I'm a fan of the buttons), and an excellent back-light. Kindle battery life has always been excellent, and is no different here. I use my Kindle daily, often for at least an hour at a time. The only downside is that I'm not sure what other features Amazon could add to improve this version, other than perhaps making it lighter weight. By far the best e-reader out there, and a worthy upgrade from a previous version",
      "processed": "family member owned every version kindle since came version finally taken best elements previous kindles combined one unit small light touch screen button functionality depending prefer fan buttons excellent kindle battery life always excellent different use kindle daily often least hour time downside sure features amazon could add improve version perhaps making lighter weight far best worthy upgrade previous version",
      "sentiment": "positive",
      "confidence": 0.95
    },
    {
      "review": "Definitely easy on the eyes for long reading sessions, especially when compared to the LCD screens of smart phones and tablets. The only issues we had were that it drops the connection to our WiFi network and then won't connect to the Kindle store. I don't think it's an issue with my network since all our other devices don't have the connectivity issues we had with this.",
      "processed": "definitely easy eyes long reading sessions especially compared lcd screens smart phones tablets issues drops connection wifi network wo connect kindle store think issue network since devices connectivity issues",
      "sentiment": "positive",
      "confidence": 0.945
    },
    {
      "review": "Have had it for a while noe. A littlebit unusual to press so hard to change page but now starting to get used to it.",
      "processed": "noe littlebit unusual press hard change page starting get used",
      "sentiment": "neutral",
      "confidence": 0.64
    },
    {
      "review": "I am extremely happy with my new Kindle Voyage. The text is so sharp and crisp, the images look much better than on the Kindle Paperwhite. The device is extremely light and comfortable to hold, The adaptive front light works great. I have an iPad with the Kindle app, but the reading experience is so much better on my Kindle Voyage that don't regret the purchase one bit.",
      "processed": "extremely happy new kindle voyage text sharp crisp images look much better kindle paperwhite device extremely light comfortable hold adaptive front light works great ipad kindle app reading experience much better kindle voyage regret purchase one bit",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "The Kindle is great for just reading books, and the battery power is pretty good.The experimental browser is not very user friendly.",
      "processed": "kindle great reading books battery power pretty experimental browser user friendly",
      "sentiment": "positive",
      "confidence": 0.94
    },
    {
      "review": "Even though it is a little pricy, I like my new Kindle Voyage. It looks smaller, but it is because it's only the screen - no buttons. It is lightweight. You can scroll and turn pages with touch screen press or with physical small buttons on the side. It is automatically adjusts to different light conditions.",
      "processed": "even though little pricy like new kindle voyage looks smaller screen buttons lightweight scroll turn pages touch screen press physical small buttons side automatically adjusts different light conditions",
      "sentiment": "positive",
      "confidence": 0.985
    },
    {
      "review": "The original electronic book. Bought it for my wife who reads paper book at two to three a week. She's hooked and loves the Kindle.",
      "processed": "original electronic book bought wife reads paper book two three week hooked loves kindle",
      "sentiment": "positive",
      "confidence": 0.985
    },
    {
      "review": "This kindle has easier viewing and the light adjustment is great.",
      "processed": "kindle easier viewing light adjustment great",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "This is so far the best Kindle I have ever owned. I love the screen and the resolution on it. The device out performs all of the other e readers on the market.",
      "processed": "far best kindle ever owned love screen resolution device performs e readers market",
      "sentiment": "positive",
      "confidence": 0.985
    },
    {
      "review": "Great looking display. Text is sharp and easy to read. The lighting of screen is wonderful for reading in lower light environments. This is a little more compact than the paper white model. I really love the page press button areas. Makes it so you can turn pages without adjusting your hand (as long as you are holding the voyage with your thumb resting in the button area). Sounds like a minor thing, but to me it's a big convenience!",
      "processed": "great looking display text sharp easy read lighting screen wonderful reading lower light environments little compact paper white model really love page press button areas makes turn pages without adjusting hand long holding voyage thumb resting button area sounds like minor thing big convenience",
      "sentiment": "positive",
      "confidence": 0.99
    },
    {
      "review": "Do most of my reading on one of my Kindles. Reading in sun light to no light is great. Easier to take anywhere size wise compared to a paperback. Really great for traveling. Download several books so I have a variety to read from. Long charge life.",
      "processed": "reading one kindles reading sun light light great easier take anywhere size wise compared paperback really great traveling download several books variety read long charge life",
      "sentiment": "positive",
      "confidence": 0.99
    },
    {
      "review": "Good value, enjoy using it! I recommend this highly!",
      "processed": "good value enjoy using recommend highly",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Exceeded my expectation. Easy to read, books load and store with ease ! Great for saving space for avid reader. I can travel with many books dont have to worry about space",
      "processed": "exceeded expectation easy read books load store ease great saving space avid reader travel many books dont worry space",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "The best kindle that I ever had!It is great if you love reading and really want to have the feel of handling a book.Great for indoor and outdoor reading",
      "processed": "best kindle ever great love reading really want feel handling indoor outdoor reading",
      "sentiment": "positive",
      "confidence": 0.985
    },
    {
      "review": "I would recommend this product. It works great and ver compact.",
      "processed": "would recommend product works great ver compact",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "This is my third Kindle and the best one yet. Love the new controls, the backlit page, the compact size and the ease of use. I would recommend the Kindle Voyage to all readers!",
      "processed": "third kindle best one yet love new controls backlit page compact size ease use would recommend kindle voyage readers",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "The voyage is light and has a battery life of Two weeks. In different light settings the Voyage automatically adjusts. My eyes do not get tired from bad lighting. Reading outside is no problem for the Voyage.",
      "processed": "voyage light battery life two weeks different light settings voyage automatically adjusts eyes get tired bad lighting reading outside problem voyage",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I have been using the paperwhite for about 2 years now and this unit definitely beats it. The adaptive lighting is amazing and page turn buttons are quite useful. If you are looking for an E-Reader then this is the one for you.",
      "processed": "using paperwhite years unit definitely beats adaptive lighting amazing page turn buttons quite useful looking one",
      "sentiment": "positive",
      "confidence": 0.955
    },
    {
      "review": "Great alternative to using tablet for reading. Only problem is trying to read a *.pdf file - it only enlarges the page and does not resize the document to easily move forward.",
      "processed": "great alternative using tablet reading problem trying read file enlarges page resize document easily move forward",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "It is a good reading device. When the price drop to 100 dollar, it is a deal. You need to buy one at that level.",
      "processed": "good reading device price drop dollar deal need buy one level",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "I have both the Kindle Voyage and the low end Kindle Fire.While the $50.00 Fire is an amazing deal, for serious readin,g the Kindle Voyage is far easier on the eyes and has superior resolution. Now, it lacks many of the features of the less expensive Fire, such as color and online with Wifi; as a reader it is well organized and a pleasure.Truthfully, it isn't a whole lot better than the Paperwhite. It has a feature or two, but I'm not sure it's worth the extra 60 dollars. It is still an excellent device.",
      "processed": "kindle voyage low end kindle fire amazing deal serious readin g kindle voyage far easier eyes superior resolution lacks many features less expensive fire color online wifi reader well organized whole lot better paperwhite feature two sure worth extra dollars still excellent device",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "bought this e-reader as a gift for my wife and she loves it",
      "processed": "bought gift wife loves",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Nice size, nice look,love the feel of turning the page. Great reading experience.",
      "processed": "nice size nice look love feel turning page great reading experience",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "I really enjoy reading on the new Kindle Voyage. Have had other Kindle models before this one. I especially like the brightness and lightness of it.Only drawback I needed to get use to was turning of pages being a little hesitant.",
      "processed": "really enjoy reading new kindle voyage kindle models one especially like brightness lightness drawback needed get use turning pages little hesitant",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "So much better than reading on an iPad, completely worth it. I guess my only complaint is the operating system still seems a little weak in terms of responsiveness and fluidity but doesn't really impact regular usage of just page turning, only felt while browsing the library/store etc.",
      "processed": "much better reading ipad completely worth guess complaint operating system still seems little weak terms responsiveness fluidity really impact regular usage page turning felt browsing etc",
      "sentiment": "positive",
      "confidence": 0.955
    },
    {
      "review": "I bought this game for my son, and he loves it..it is very entertaining.",
      "processed": "bought game son loves entertaining",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Works great, looks great, readable in bright sun...",
      "processed": "works great looks great readable bright sun",
      "sentiment": "positive",
      "confidence": 0.95
    },
    {
      "review": "Good for leisure/reading for fun. Not for students.",
      "processed": "good fun students",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Really like the Kindle. The screen is very easy on the eyes, much better for reading than my Ipad!.",
      "processed": "really like kindle screen easy eyes much better reading ipad",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "Love my Kindle Voyage. The size is much smaller than my older Kindle and the weight is much less. This helps as I take fm Kindle everywhere. Love the touch screen features.",
      "processed": "love kindle voyage size much smaller older kindle weight much less helps take fm kindle everywhere love touch screen features",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "One of the things I love the most about my new Kindle is it's size. It slides so nicely into my compact purse, protective case and all. Another thing I've noticed is the lack of glare that I experienced with my old Kindle. It automatically adjusts to the light and I'm looking forward to being able to read it on the beach without a struggle. I also love the battery life - it goes on forever. The case I bought makes it possible to stand my Kindle up in front of me and read while I'm eating - a must for me - I never eat alone ;)",
      "processed": "one things love new kindle size slides nicely compact purse protective case another thing noticed lack glare experienced old kindle automatically adjusts light looking forward able read beach without struggle also love battery life goes forever case bought makes possible stand kindle front read eating must never eat alone",
      "sentiment": "positive",
      "confidence": 0.98
    },
    {
      "review": "What a great ereader. Amazon continues its dominance in the ereader field with this entry. Light and comfortable to hold. Perfect combination of hepatic feedback buttons and adaptive back-lighting. Seems to stay charged forever even with regular use. I would definitely recommend this and would buy again.",
      "processed": "great ereader amazon continues dominance ereader field entry light comfortable hold perfect combination hepatic feedback buttons adaptive seems stay charged forever even regular use would definitely recommend would buy",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "excellent screen, the small changes to the form make a huge different (I adore the flatness so much), and the brightness is a perfect for daylight. IMO, worth the cost",
      "processed": "excellent screen small changes form make huge different adore flatness much brightness perfect daylight imo worth cost",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Kindle Voyage is easily the best e-reader with an impressive high-resolution display and it is very thin and light weight too. Loving it.",
      "processed": "kindle voyage easily best impressive display thin light weight loving",
      "sentiment": "positive",
      "confidence": 0.99
    },
    {
      "review": "This is my first kindle but I'm loving it. I picked it up a few days after it was released. One of the things I love the most is I'm a reader but I am not a car owner so I get almost everywhere by bike. I got tired of lugging around heavy hardcover books from the library; now my Voyage weighs less than most paperback books. An extra bonus for me is, it fits in a pocket I wasn't using in my pannier I carry stuff to work everyday. I love the clarity of the text and pressure point page turning versus screen swipes. I also love that I charged it when I got 4 days ago and it is still more than have battery power.",
      "processed": "first kindle loving picked days released one things love reader car owner get almost everywhere bike got tired lugging around heavy hardcover books library voyage weighs less paperback books extra bonus fits pocket using pannier carry stuff work everyday love clarity text pressure point page turning versus screen swipes also love charged got days ago still battery power",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Love this kindle - the press side page turner is great.",
      "processed": "love kindle press side page turner great",
      "sentiment": "positive",
      "confidence": 0.98
    },
    {
      "review": "Reallllllllllllllllllllllllllllllllllllllllllllllly",
      "processed": "reallllllllllllllllllllllllllllllllllllllllllllllly",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "The new design is lighter, has a longer battery life and the page displays are crisp and clear. The light adapts to the environment you are reading in to keep the image consistent. The new Kindle Voyage is amazing!",
      "processed": "new design lighter longer battery life page displays crisp clear light adapts environment reading keep image consistent new kindle voyage amazing",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "This is by far the best reader for all lighting environments. The only drawback I see are the constant ads when you log on to the device, and the library interfaceneeds to be more intuitive. However, I'm very satisfied with my purchase and use of this Voyage. I've already read over six books with it in just 3+ weeks.",
      "processed": "far best reader lighting environments drawback see constant ads log device library interfaceneeds intuitive however satisfied purchase use voyage already read six books weeks",
      "sentiment": "positive",
      "confidence": 0.965
    },
    {
      "review": "I have a previous version of the Kindle, but this one surpasses it in every way, from the resolution to the automatic brightness display. Recommend it highly.",
      "processed": "previous version kindle one surpasses every way resolution automatic brightness display recommend highly",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "The Kindle voyager is absolutely a best product for reading ebooks. The product is easy to read in all types of light. I also like the ability to get word definitions and the expansion or text ability.",
      "processed": "kindle voyager absolutely best product reading ebooks product easy read types light also like ability get word definitions expansion text ability",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Upgrading from an older Kindle. Wow. Lighter. Crisper text is an understatement. Throw in the lighting and the new interface for page advancement. Pricey but if you want the best, you won't be disappointed.",
      "processed": "upgrading older kindle wow lighter crisper text understatement throw lighting new interface page advancement pricey want best wo disappointed",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "It's a great eReader and the font is much clearer than that of the Paperwhite, but that may not be enough to justify the extra $$$. The page turn buttons are a great addition too.Would be good if Amazon would add audiobook capability though.",
      "processed": "great ereader font much clearer paperwhite may enough justify extra page turn buttons great addition good amazon would add audiobook capability though",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I've always been a reader and an early technology adopter but until now I've resisted moving to electronic media when reading for pleasure. Now I wish I hadn't waited so long. Reading at night with the lights off and instantly downloading a new book are my favorite aspects.",
      "processed": "always reader early technology adopter resisted moving electronic media reading pleasure wish waited long reading night lights instantly downloading new book favorite aspects",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "We upgraded from an older paper white and couldn't be happier.",
      "processed": "upgraded older paper white could happier",
      "sentiment": "positive",
      "confidence": 0.955
    },
    {
      "review": "I have had several variations of the Kindle in the past. My most recent being a paperwhite. I have to say this is the best. The size and balance are better. The adaptable light feature and brightness is good. Screen quality and construction are both an improvement. The overall reading experience is much improved over the paperwhite.",
      "processed": "several variations kindle past recent paperwhite say best size balance better adaptable light feature brightness good screen quality construction improvement overall reading experience much improved paperwhite",
      "sentiment": "positive",
      "confidence": 0.99
    },
    {
      "review": "I really missed my first kindle when my husband gave me a fire 2 years ago. I love to read outside and could not do that with a fire. The voyage is perfect, easy to read anywhere, much longer battery life than a fire. Very happy with it and the buttons are easy to use or you can just tap the screen to turn the page.",
      "processed": "really missed first kindle husband gave fire years ago love read outside could fire voyage perfect easy read anywhere much longer battery life fire happy buttons easy use tap screen turn page",
      "sentiment": "positive",
      "confidence": 0.975
    },
    {
      "review": "Coming from a nook reader. Love the even backlighting and weight.",
      "processed": "coming nook reader love even backlighting weight",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Purchased after theft in Seattle. It was on sale and works great.",
      "processed": "purchased theft seattle sale works great",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I had to ask for help because they don't keep this model on display, it's \"behind the counter\". But other than that, in-store was a breeze. And the product exceeds my expectations. Although, it would be even better if it was waterproof--- but it does perfectly fit into a medium baggie.",
      "processed": "ask help keep model display behind counter breeze product exceeds expectations although would even better waterproof perfectly fit medium baggie",
      "sentiment": "positive",
      "confidence": 0.99
    },
    {
      "review": "Great item, easy to use,would recommend to anybody want to use!",
      "processed": "great item easy use would recommend anybody want use",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "New kindle is so much better than paperwhite. Kitty hair always used to get stuck around the borders of the paperwhite - not a problem with the voyage.",
      "processed": "new kindle much better paperwhite kitty hair always used get stuck around borders paperwhite problem voyage",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "why carry a book when you can have a library at your fingertips? Get one now!",
      "processed": "carry book library fingertips get one",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I got this for my sister who is in Paris and she doesn't go anywhere without it. All the benefits of a real book and none of the cons.",
      "processed": "got sister paris go anywhere without benefits real book none cons",
      "sentiment": "positive",
      "confidence": 0.95
    },
    {
      "review": "I never owned a Kindle before. This was easy to setup and get going.It also looks really good. The text is super easy to read even at smaller fonts. I also really like the buttons on the side that turn the pages because it is a lot easier to flip pages compared to tapping the screen.",
      "processed": "never owned kindle easy setup get also looks really good text super easy read even smaller fonts also really like buttons side turn pages lot easier flip pages compared tapping screen",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Overall I've been very happy with my new Kindle Voyage, the screen is much sharper than my wife's paperwhite (v1) and the backlight is much more even. I've also been very happy with the page turn buttons. It makes it significantly more convenient to turn pages than using the screen and the pressure and feedback both seem about right. The only issue I have that keeps this from earning 5 stars is that the backlight on the screen has a slightly two-tone hue. It is somewhat yellowish on top and bluish on the bottom of the screen. It isn't something that really distracts from reading but it is noticeable when looking for it. Fix this so the coloring is even and it is really a perfect ereader.",
      "processed": "overall happy new kindle voyage screen much sharper wife paperwhite backlight much even also happy page turn buttons makes significantly convenient turn pages using screen pressure feedback seem right issue keeps earning stars backlight screen slightly hue somewhat yellowish top bluish bottom screen something really distracts reading noticeable looking fix coloring even really perfect ereader",
      "sentiment": "positive",
      "confidence": 0.92
    },
    {
      "review": "Gave this to my wife for Christmas to replace her well used first generation kindle. She loves it.",
      "processed": "gave wife christmas replace well used first generation kindle loves",
      "sentiment": "positive",
      "confidence": 0.99
    },
    {
      "review": "I love my Kindle Voyage, however it does not have a speaker for audio books. and changes settings ie. remaining time/pages left in book on it's own.",
      "processed": "love kindle voyage however speaker audio books changes settings ie remaining left book",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "Clear reading in bright light outdoor settings. Long battery life.",
      "processed": "clear reading bright light outdoor settings long battery life",
      "sentiment": "neutral",
      "confidence": 0.66
    },
    {
      "review": "Went back and forth between this and the Oasis but in the end just couldn't justify the added cost. So far I'm happy with this model.",
      "processed": "went back forth oasis end could justify added cost far happy model",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "This is my third one of these and this is the best one by far.",
      "processed": "third one best one far",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "This eReader is great, I have started reading more now that I have this kindle than when I read paperbacks. If you are torn on buying this for yourself or someone else I can almost guarantee anyone would love this. With enabled dictionaries and X-ray I'm finally able to tackle books with a heavy character list like Game of Thrones. I'm serious, this is so convienent and user friendly. The only negative about this device is the amount of money you will spend on new books in excitement when you first connect to Amazon with it.",
      "processed": "ereader great started reading kindle read paperbacks torn buying someone else almost guarantee anyone would love enabled dictionaries finally able tackle books heavy character list like game thrones serious convienent user friendly negative device amount money spend new books excitement first connect amazon",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "This readeri is compact and fits nicely in my bag. Easy to use, controls for children are very effective. Am glad I bought it.",
      "processed": "readeri compact fits nicely bag easy use controls children effective glad bought",
      "sentiment": "positive",
      "confidence": 0.975
    },
    {
      "review": "I have a Paper White 1 and 2. Honestly it is difficult to justify double the price value. I certainly like most added features but not sure its worth the extra money. To note it operates great just not sure its worth an upgrade to the latest greatest.",
      "processed": "paper white honestly difficult justify double price value certainly like added features sure worth extra money note operates great sure worth upgrade latest greatest",
      "sentiment": "positive",
      "confidence": 0.98
    },
    {
      "review": "My first ebook reader. Read some reviews, decided to go with this because of the backlight and adaptive light. Sometimes I have to adjust the light manually but no biggie, quick and easy on the eyes.",
      "processed": "first ebook reader read reviews decided go backlight adaptive light sometimes adjust light manually biggie quick easy eyes",
      "sentiment": "positive",
      "confidence": 0.98
    },
    {
      "review": "We bought this reader to replace a Fire HDX that had seemed to go wonky. Turns out a couple of system resets and the HDX is back to normal so I get the old one, she gets the new one.But I can highly recommend this reader - the clarity of the text and the overall functionality is excellent.",
      "processed": "bought reader replace fire hdx seemed go wonky turns couple system resets hdx back normal get old one gets new highly recommend reader clarity text overall functionality excellent",
      "sentiment": "positive",
      "confidence": 0.97
    },
    {
      "review": "Good for reading white and blackScreen is still small",
      "processed": "good reading white blackscreen still small",
      "sentiment": "positive",
      "confidence": 0.97
    },
    {
      "review": "the best feature of this Kindle is the page forward/back buttons which allow you to turn pages without taking hards off the unit.",
      "processed": "best feature kindle page buttons allow turn pages without taking hards unit",
      "sentiment": "positive",
      "confidence": 0.99
    },
    {
      "review": "Moving to this from the first generation Paperwhite appears to have been the right move. I love the new size, it just feels tiny and perfect in the hand. The new automatic brightness setting works quite well. I do wish I could crank up the force required to activate the page turn buttons however, as I have frequently hit them accidentally. The page turn buttons do work with gloves on which a great for reading in a tree stand.",
      "processed": "moving first generation paperwhite appears right move love new size feels tiny perfect hand new automatic brightness setting works quite well wish could crank force required activate page turn buttons however frequently hit accidentally page turn buttons work gloves great reading tree stand",
      "sentiment": "positive",
      "confidence": 0.965
    },
    {
      "review": "Bought this for my cousins and he absolutely loves it.",
      "processed": "bought cousins absolutely loves",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "Works as expected. Very easy to use and does not hurt my eyes like a tablet would.",
      "processed": "works expected easy use hurt eyes like tablet would",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "I bought this as a gift. I think it is pretty decent both quality and design.",
      "processed": "bought gift think pretty decent quality design",
      "sentiment": "positive",
      "confidence": 0.995
    },
    {
      "review": "It is a very good E-Reader, battery lasts for weeks.",
      "processed": "good battery lasts weeks",
      "sentiment": "positive",
      "confidence": 0.975
    },
    {
      "review": "My Kindle Voyage is nearly 16 months old and worked perfectly. I kept receiving emails from Amazon about the software update. I switched off airplane mode, switched on wifi and shortly after the screen locked up. I have tried everything with customer support and they now tell me I will have to buy a new one. I am very annoyed. If I had left the software as it was my Kindle Voyage would still be working.",
      "processed": "kindle voyage nearly months old worked perfectly kept receiving emails amazon software update switched airplane mode switched wifi shortly screen locked tried everything customer support tell buy new one annoyed left software kindle voyage would still working",
      "sentiment": "negative",
      "confidence": 0.64
    },
    {
      "review": "I had been reading books on my iPad for years and finally broke down to get a kindle. It's exactly what I hoped. The screen is easy to read in any light. It's a light weight and size and easy to stow away in a small bag.",
      "processed": "reading books ipad years finally broke get kindle exactly hoped screen easy read light light weight size easy stow away small bag",
      "sentiment": "positive",
      "confidence": 1.0
    },
    {
      "review": "This is my first e reader. I did ttry my friends papperwhite but voyage is the best of the e reader world. The screen is awesome. I read a lot at night before I sleep and I use to read in my mobile which after sometime feels like my eyes are burning. But with voyage I can read as much time I want. No strain no burning sensation in my eyes. Compared to the papperwhite the screen looks better. Feels like I am actually reading a paper book.",
      "processed": "first e reader ttry friends papperwhite voyage best e reader world screen awesome read lot night sleep use read mobile sometime feels like eyes burning voyage read much time want strain burning sensation eyes compared papperwhite screen looks better feels like actually reading paper book",
      "sentiment": "positive",
      "confidence": 0.985
    },
    {
      "review": "I upgraded my Kindle to the Kindle Voyage because I read in bed and the lamp kept my husband awake. I thought I would be able to use this Kindle without the lamp, but for me it is hard to read with the room completely dark even though the back lighting is adjustable. I still use the Kindle with the lamp on, but tilted to the floor so that there is just a little light in the room....I bought the magnetic case so when I open the lid, the Kindle wakes up. It is a little smaller than my old Kindle and fits in my purse perfectly. All in All I LOVE it and would highly recommend it.",
      "processed": "upgraded kindle kindle voyage read bed lamp kept husband awake thought would able use kindle without lamp hard read room completely dark even though back lighting adjustable still use kindle lamp tilted floor little light room bought magnetic case open lid kindle wakes little smaller old kindle fits purse perfectly love would highly recommend",
      "sentiment": "positive",
      "confidence": 0.97
    }
  ]
}